Repository: franck-paul/hljs
Catalog: locales/*/main.po
Languages: fr

source: Code highlight
fr: Coloration syntaxique

source: highlight.js for Dotclear
fr: highlight.js pour Dotclear

source: Highlighted Code
fr: Coloration syntaxique

source: copy
fr: copier

source: copied
fr: copié

source: Automatic
fr: Automatique

source: Plain Text
fr: Texte simple

source: Syntax Selector
fr: Sélecteur de syntaxe

source: Select the primary syntax of your code snippet:
fr: Sélectionnez la syntaxe principale de votre extrait de code :

source: Cancel
fr: Annuler

source: Minimum (23 languages, 53 Kb)
fr: Minimum (23 syntaxes, 53 Ko)

source: Default (46 languages, 93 Kb)
fr: Défaut (46 syntaxes, 93 Ko)

source: Common (92 languages, 284 Kb)
fr: Commun (92 syntaxes, 284 Kb)

source: Full (185 languages, 731 Kb)
fr: Complet (185 syntaxes, 731 Kb)

source: Default
fr: Défaut

source: Light themes
fr: Thèmes clairs

source: Dark themes
fr: Thèmes sombres

source: Enable Code highlight
fr: Activer la coloration syntaxique du code

source: Presentation
fr: Présentation

source: Theme:
fr: Thème :

source: Set of languages:
fr: Ensemble de languages :

source: List of languages:
fr: Liste des langages :

source: Show syntax badge
fr: Afficher le badge de syntaxe

source: Hide gutter with line numbers
fr: Masquer la gouttière avec des numéros de ligne

source: Hide copy button
fr: Masquer le bouton de copie dans le presse-papier

source: Use parallel processing (web workers)
fr: Utiliser le traitement parallèle (web workers)

source: The use of parallel processing (web workers), if supported by the browser, enables faster processing of code extracts, but can consume much more memory.
fr: L'utilisation du traitement parallèle (web workers), si il est pris en charge par le navigateur, permet un traitement plus rapide des extraits de code, mais peut consommer beaucoup plus de mémoire.

source: Use custom CSS:
fr: Utiliser des feuilles de style CSS personnalisées :

source: A location beginning with a / is treated as absolute, else it is treated as relative to the blog's current theme URL
fr: Un emplacement commençant par un / est considéré comme absolu, sinon il est considéré comme relatif à l'URL du thème actuel du blog.

source: You can use a custom CSS by providing its location.
fr: Vous pouvez utiliser un CSS personnalisé en indiquant son emplacement.

source: Compatibiliy
fr: Compatibilité

source: Yash compatibility mode
fr: Mode de compatibilité Yash

source: Some of YASH languages are not supported by Code highlight (see documentation).
fr: Certains langages YASH ne sont pas pris en charge par Code highlight (voir la documentation).

source: Will be applied on future edition of posts containing YASH macros (///yash …///).
fr: Sera appliqué sur les prochaines éditions des posts contenant des macros YASH (///yash ...///).

source: SyntaxeHL compatibility mode
fr: Mode de compatibilité SyntaxeHL

source: All SyntaxeHL languages are not supported by Code highlight (see documentation).
fr: Tous les langages SyntaxeHL ne sont pas pris en charge par Code highlight (voir la documentation).

source: Will be applied on future edition of posts containing SyntaxeHL macros (///[language]…///).
fr: Sera appliqué sur les prochaines éditions de billets contenant des macros SyntaxeHL (///[langue]...///).

source: Generic code compatibility mode
fr: Mode de compatibilité avec le code générique

source: Will be applied on future edition of posts containing generic code macros (///code [language]…///).
fr: Sera appliqué dans les prochaines éditions des messages contenant des macros de code génériques (///code [langue]...///).
